tests/cases/freezeOffGuard/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
convertToMeters 1;
vertices
(
(0 0 0)
(0 0 0.01)
(0 0.01 0)
(0 0.01 0.01)
(0.0047 0 0)
(0.0047 0 0.01)
(0.0047 0.01 0)
(0.0047 0.01 0.01)
(0.0053 0 0)
(0.0053 0 0.01)
(0.0053 0.01 0)
(0.0053 0.01 0.01)
(0.01 0 0)
(0.01 0 0.01)
(0.01 0.01 0)
(0.01 0.01 0.01)
);
blocks
(
hex (0 4 6 2 1 5 7 3) (22 10 10) simpleGrading (1 1 1)
hex (4 8 10 6 5 9 11 7) (3 10 10) simpleGrading (1 1 1)
hex (8 12 14 10 9 13 15 11) (22 10 10) simpleGrading (1 1 1)
);
boundary
(
    gate  { type patch; faces ( (4 6 10 8) ); }
    walls
    {
        type wall;
        faces
        (
            (0 2 6 4) (8 10 14 12)
            (0 4 5 1) (2 3 7 6)
            (4 8 9 5) (6 7 11 10)
            (8 12 13 9) (10 11 15 14)
            (0 2 3 1) (12 14 15 13)
        );
    }
    vent  { type patch; faces ( (1 5 7 3) (5 9 11 7) (9 13 15 11) ); }
);
