tests/cases/freezeOffGuard/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class "volScalarField";
    object p;
}
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1e5;
boundaryField
{

    gate
    {
        type            calculated;
        value           $internalField;
    }
    #includeEtc "caseDicts/setConstraintTypes"


    vent
    {
        type            calculated;
        value           $internalField;
    }

    walls
    {
        type            calculated;
        value           $internalField;
    }
}
