tests/cases/freezeOffGuard/0/p_rgh
FoamFile
{
    version 2.0;
    format ascii;
    class "volScalarField";
    object p_rgh;
}
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1e5;
boundaryField
{

    gate
    {
        type            moldingPrghPressure;
        refValue        uniform 1e5;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 1e5;
    }
    #includeEtc "caseDicts/setConstraintTypes"


    vent
    {
        type            moldingVentPressure;
        p0              1e5;
        CdA             1e-06;
        value           $internalField;
    }

    walls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}
