tests/cases/freezeOffGuard/system/expectedPatterns
moldingFoam: melt freeze-off detected
moldingFoam: V/P switch
End
