tests/cases/freezeOffGuard/system/verifyScript
verify-freeze-off-guard.py
